---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.MaterialName
source: html/855b9816-3d6a-08dd-b263-1c458d32f4a4.htm
---
# Autodesk.Revit.DB.ParameterTypeId.MaterialName Property

"Name"

## Syntax (C#)
```csharp
public static ForgeTypeId MaterialName { get; }
```